<!DOCTYPE html>
<html lang="en">

<head>
    <?php $now = 'OUR TEA';
    $menu = 'OUR TEA';
    $number = '03';
    ?>
    <?php include 'html_head.php'; ?>
</head>


<body>
    <?php include 'topmenu.php'; ?>
    <div class="our-teaWrap">
        <div class="head-area">
            <div class="inner">
                <div class="en">OUR <span>TEA</span></div>
            </div>
            <div class="drinkListWrap">
                <ul class="drink">
                    <li>
                        <div class="name">
                            <div class="en">Black Tea Latte</div>
                            <div class="ch">紅茶拿鐵</div>
                        </div>
                        <img src="./images/drink-1.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">No.8 Juice</div>
                            <div class="ch">8冰茶</div>
                        </div>
                        <img src="./images/drink-2.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">Golden Bubble Milk Tea</div>
                            <div class="ch">黃金珍奶</div>
                        </div>
                        <img src="./images/drink-3.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">Black Tea Macchiato</div>
                            <div class="ch">紅茶瑪奇朵</div>
                        </div>
                        <img src="./images/drink-4.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">Taro Purple Paste Milk Tea</div>
                            <div class="ch">鑲芋奶茶</div>
                        </div>
                        <img src="./images/drink-5.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">Brown Sugar Fresh Milk</div>
                            <div class="ch">厚黑糖鮮奶</div>
                        </div>
                        <img src="./images/drink-6.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">Black Tea Latte</div>
                            <div class="ch">紅茶拿鐵</div>
                        </div>
                        <img src="./images/drink-1.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">No.8 Juice</div>
                            <div class="ch">8冰茶</div>
                        </div>
                        <img src="./images/drink-2.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">Golden Bubble Milk Tea</div>
                            <div class="ch">黃金珍奶</div>
                        </div>
                        <img src="./images/drink-3.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">Black Tea Macchiato</div>
                            <div class="ch">紅茶瑪奇朵</div>
                        </div>
                        <img src="./images/drink-4.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">Taro Purple Paste Milk Tea</div>
                            <div class="ch">鑲芋奶茶</div>
                        </div>
                        <img src="./images/drink-5.png" alt="">
                    </li>
                    <li>
                        <div class="name">
                            <div class="en">Brown Sugar Fresh Milk</div>
                            <div class="ch">厚黑糖鮮奶</div>
                        </div>
                        <img src="./images/drink-6.png" alt="">
                    </li>
                </ul>
                <!-- <div class="drink-mobile swiper mySwiper hide-for-large">
                    <ul class="swiper-wrapper">
                        <li class="swiper-slide">
                            <div class="inner-drink">
                                <div class="name">
                                    <div class="en">Black Tea<br>Latte</div>
                                    <div class="ch">紅茶拿鐵</div>
                                </div>
                                <img src="./images/drink-1.png">
                            </div>
                        </li>
                        <li class="swiper-slide">
                            <div class="inner-drink">
                                <div class="name">
                                    <div class="en">No.8 Juice</div>
                                    <div class="ch">8冰茶</div>
                                </div>
                                <img src="./images/drink-2.png">
                            </div>
                        </li>
                        <li class="swiper-slide">
                            <div class="inner-drink">
                                <div class="name">
                                    <div class="en">Golden Bubble<br>Milk Tea</div>
                                    <div class="ch">黃金珍奶</div>
                                </div>
                                <img src="./images/drink-3.png">
                            </div>
                        </li>
                        <li class="swiper-slide">
                            <div class="inner-drink">
                                <div class="name">
                                    <div class="en">Black Tea<br>Macchiato</div>
                                    <div class="ch">紅茶瑪奇朵</div>
                                </div>
                                <img src="./images/drink-4.png">
                            </div>
                        </li>
                        <li class="swiper-slide">
                            <div class="inner-drink">
                                <div class="name">
                                    <div class="en">Taro Purple<br>Paste Milk Tea</div>
                                    <div class="ch">鑲芋奶茶</div>
                                </div>
                                <img src="./images/drink-5.png">
                            </div>
                        </li>
                        <li class="swiper-slide">
                            <div class="inner-drink">
                                <div class="name">
                                    <div class="en">Brown Sugar<br>Fresh Milk</div>
                                    <div class="ch">厚黑糖鮮奶</div>
                                </div>
                                <img src="./images/drink-6.png">
                            </div>
                        </li>
                    </ul>
                </div> -->
                <div class="scroll-down">
                    <svg class="show-for-large" id="b" data-name="圖層 2" xmlns="http://www.w3.org/2000/svg" width="170.03" height="55.27" viewBox="0 0 170.03 55.27">
                        <g id="c" data-name="設計">
                            <g>
                                <g>
                                    <path class="d" d="M3.56,55.27c-1.15-.67-2.03-1.56-2.64-2.67-.61-1.11-.92-2.38-.92-3.81s.31-2.7,.92-3.82c.61-1.12,1.49-2,2.64-2.67l.76,.9c-.96,.58-1.7,1.35-2.21,2.31-.51,.96-.77,2.05-.77,3.28s.26,2.3,.77,3.27,1.25,1.73,2.21,2.3l-.76,.91Z" />
                                    <path class="d" d="M13.24,52.4c-.78,0-1.54-.15-2.27-.46-.73-.31-1.37-.74-1.93-1.3l.9-1.04c.53,.52,1.08,.91,1.63,1.16,.55,.25,1.14,.38,1.74,.38,.48,0,.89-.07,1.25-.2,.36-.13,.64-.33,.83-.58,.2-.25,.29-.54,.29-.85,0-.44-.15-.77-.46-1.01-.31-.23-.82-.41-1.53-.53l-1.64-.27c-.9-.16-1.57-.45-2.01-.87s-.67-.98-.67-1.68c0-.56,.15-1.05,.45-1.48,.3-.42,.72-.75,1.27-.99,.55-.23,1.18-.35,1.9-.35s1.41,.11,2.09,.34c.69,.23,1.3,.56,1.86,.99l-.81,1.12c-1.05-.8-2.12-1.2-3.21-1.2-.43,0-.8,.06-1.12,.18-.32,.12-.56,.29-.74,.51-.18,.22-.27,.47-.27,.76,0,.4,.14,.71,.41,.92,.27,.21,.72,.36,1.34,.46l1.58,.27c1.04,.17,1.8,.47,2.28,.91,.48,.44,.73,1.04,.73,1.81,0,.6-.16,1.12-.49,1.58s-.78,.8-1.37,1.06-1.27,.38-2.04,.38Z" />
                                    <path class="d" d="M22.46,52.39c-.68,0-1.3-.16-1.86-.49-.56-.33-1-.77-1.32-1.33-.32-.56-.48-1.18-.48-1.88s.16-1.31,.49-1.87c.33-.55,.77-1,1.32-1.33,.56-.33,1.17-.5,1.85-.5,.54,0,1.06,.1,1.56,.31s.93,.5,1.29,.87l-.87,.97c-.27-.3-.57-.52-.91-.67s-.69-.22-1.05-.22c-.43,0-.82,.11-1.17,.32-.35,.21-.63,.51-.83,.88-.21,.37-.31,.79-.31,1.25s.1,.87,.31,1.25c.21,.37,.48,.67,.84,.89,.35,.22,.75,.33,1.19,.33,.36,0,.71-.07,1.02-.22,.32-.14,.62-.36,.9-.64l.85,.9c-.37,.38-.8,.68-1.29,.88s-1,.31-1.53,.31Z" />
                                    <path class="d" d="M27.03,52.26v-7.13h1.4v.91c.22-.34,.5-.6,.83-.79s.71-.29,1.13-.29c.29,0,.53,.05,.71,.13v1.26c-.13-.06-.27-.1-.41-.12-.14-.02-.28-.03-.42-.03-.41,0-.77,.11-1.09,.33-.32,.22-.57,.54-.76,.96v4.77h-1.4Z" />
                                    <path class="d" d="M35.84,52.4c-.69,0-1.32-.16-1.88-.49-.57-.33-1.01-.77-1.34-1.33-.33-.56-.49-1.19-.49-1.88s.16-1.32,.49-1.88c.33-.56,.77-1.01,1.34-1.34,.56-.33,1.19-.5,1.88-.5s1.33,.17,1.89,.5c.56,.33,1,.78,1.33,1.34,.33,.56,.49,1.18,.49,1.88s-.16,1.32-.49,1.88c-.33,.56-.77,1-1.33,1.33-.56,.33-1.19,.49-1.89,.49Zm0-1.23c.44,0,.83-.11,1.19-.33,.35-.22,.63-.52,.84-.89,.21-.37,.31-.79,.31-1.26s-.1-.87-.32-1.24c-.21-.37-.49-.67-.84-.89-.35-.22-.74-.34-1.18-.34s-.83,.11-1.18,.34c-.35,.22-.63,.52-.84,.89-.21,.37-.32,.78-.32,1.24s.1,.89,.31,1.26c.21,.37,.49,.67,.84,.89,.36,.22,.75,.33,1.19,.33Z" />
                                    <path class="d" d="M41.51,52.26v-9.8l1.4-.27v10.07h-1.4Z" />
                                    <path class="d" d="M45.19,52.26v-9.8l1.4-.27v10.07h-1.4Z" />
                                    <path class="d" d="M55.48,52.39c-.69,0-1.22-.16-1.58-.48-.36-.32-.55-.79-.55-1.41v-4.19h-1.51v-1.18h1.51v-1.82l1.39-.34v2.16h2.1v1.18h-2.1v3.86c0,.36,.08,.62,.24,.78,.16,.15,.43,.23,.81,.23,.2,0,.37-.01,.52-.04,.15-.03,.32-.07,.5-.13v1.18c-.19,.07-.4,.11-.65,.15-.25,.03-.47,.05-.68,.05Z" />
                                    <path class="d" d="M61.77,52.4c-.69,0-1.32-.16-1.88-.49-.56-.33-1.01-.77-1.34-1.33-.33-.56-.49-1.19-.49-1.88s.16-1.32,.49-1.88c.33-.56,.77-1.01,1.34-1.34,.56-.33,1.19-.5,1.88-.5s1.33,.17,1.89,.5c.56,.33,1,.78,1.33,1.34,.33,.56,.49,1.18,.49,1.88s-.16,1.32-.49,1.88c-.33,.56-.77,1-1.33,1.33-.56,.33-1.19,.49-1.89,.49Zm0-1.23c.44,0,.84-.11,1.19-.33s.63-.52,.84-.89c.21-.37,.31-.79,.31-1.26s-.1-.87-.31-1.24c-.21-.37-.49-.67-.84-.89-.35-.22-.74-.34-1.18-.34s-.83,.11-1.18,.34c-.35,.22-.63,.52-.84,.89-.21,.37-.32,.78-.32,1.24s.1,.89,.31,1.26c.21,.37,.48,.67,.84,.89,.35,.22,.75,.33,1.19,.33Z" />
                                    <path class="d" d="M74.41,52.39c-.7,0-1.33-.16-1.9-.49-.57-.33-1.01-.77-1.34-1.33-.33-.56-.5-1.18-.5-1.88s.16-1.3,.48-1.85c.32-.56,.75-1,1.29-1.33s1.14-.5,1.81-.5,1.25,.17,1.76,.5,.92,.78,1.22,1.34c.3,.57,.46,1.2,.46,1.91v.39h-5.61c.07,.39,.22,.74,.44,1.05,.22,.31,.5,.55,.84,.73,.34,.18,.71,.27,1.11,.27,.34,0,.68-.05,1-.16s.59-.26,.8-.47l.9,.88c-.42,.32-.85,.55-1.29,.71-.44,.15-.93,.23-1.46,.23Zm-2.32-4.28h4.21c-.06-.37-.18-.7-.38-.99-.2-.29-.45-.51-.74-.67-.29-.16-.61-.24-.96-.24s-.68,.08-.98,.24c-.3,.16-.55,.38-.75,.67-.2,.29-.33,.62-.4,1Z" />
                                    <path class="d" d="M78.34,52.26l2.77-3.65-2.66-3.47h1.64l1.83,2.44,1.83-2.44h1.58l-2.63,3.46,2.8,3.67h-1.64l-1.97-2.63-1.97,2.63h-1.58Z" />
                                    <path class="d" d="M87.01,55.12v-9.98h1.39v.69c.6-.53,1.33-.8,2.18-.8,.67,0,1.28,.16,1.83,.49,.55,.33,.98,.77,1.29,1.32,.32,.55,.48,1.17,.48,1.86s-.16,1.31-.48,1.87c-.32,.56-.76,1-1.3,1.32s-1.16,.49-1.84,.49c-.39,0-.77-.06-1.13-.19-.36-.13-.7-.31-1.01-.54v3.47h-1.4Zm3.39-3.96c.46,0,.87-.11,1.23-.32s.65-.51,.86-.88c.21-.37,.32-.79,.32-1.25s-.11-.89-.32-1.26c-.21-.37-.5-.67-.86-.88-.36-.21-.77-.32-1.23-.32-.4,0-.77,.07-1.12,.22s-.63,.36-.87,.63v3.22c.23,.26,.52,.47,.88,.62,.35,.15,.72,.22,1.11,.22Z" />
                                    <path class="d" d="M96.14,52.26v-9.8l1.4-.27v10.07h-1.4Z" />
                                    <path class="d" d="M103.21,52.4c-.69,0-1.32-.16-1.88-.49-.56-.33-1.01-.77-1.34-1.33-.33-.56-.49-1.19-.49-1.88s.16-1.32,.49-1.88c.33-.56,.77-1.01,1.34-1.34,.56-.33,1.19-.5,1.88-.5s1.33,.17,1.89,.5c.56,.33,1,.78,1.33,1.34,.33,.56,.49,1.18,.49,1.88s-.16,1.32-.49,1.88c-.33,.56-.77,1-1.33,1.33-.56,.33-1.19,.49-1.89,.49Zm0-1.23c.44,0,.84-.11,1.19-.33s.63-.52,.84-.89c.21-.37,.31-.79,.31-1.26s-.1-.87-.31-1.24c-.21-.37-.49-.67-.84-.89-.35-.22-.74-.34-1.18-.34s-.83,.11-1.18,.34c-.35,.22-.63,.52-.84,.89-.21,.37-.32,.78-.32,1.24s.1,.89,.31,1.26c.21,.37,.48,.67,.84,.89,.35,.22,.75,.33,1.19,.33Z" />
                                    <path class="d" d="M108.88,52.26v-7.13h1.4v.91c.22-.34,.5-.6,.83-.79s.71-.29,1.13-.29c.29,0,.53,.05,.71,.13v1.26c-.13-.06-.27-.1-.41-.12-.14-.02-.28-.03-.42-.03-.41,0-.77,.11-1.09,.33-.32,.22-.57,.54-.76,.96v4.77h-1.4Z" />
                                    <path class="d" d="M117.71,52.39c-.7,0-1.33-.16-1.9-.49-.57-.33-1.01-.77-1.34-1.33-.33-.56-.5-1.18-.5-1.88s.16-1.3,.48-1.85c.32-.56,.75-1,1.29-1.33s1.14-.5,1.81-.5,1.25,.17,1.76,.5,.92,.78,1.22,1.34c.3,.57,.46,1.2,.46,1.91v.39h-5.61c.07,.39,.22,.74,.44,1.05,.22,.31,.5,.55,.84,.73,.34,.18,.71,.27,1.11,.27,.34,0,.68-.05,1-.16s.59-.26,.8-.47l.9,.88c-.42,.32-.85,.55-1.29,.71-.44,.15-.93,.23-1.46,.23Zm-2.32-4.28h4.21c-.06-.37-.18-.7-.38-.99-.2-.29-.45-.51-.74-.67-.29-.16-.61-.24-.96-.24s-.68,.08-.98,.24c-.3,.16-.55,.38-.75,.67-.2,.29-.33,.62-.4,1Z" />
                                    <path class="d" d="M126.5,52.26v-7.13h1.4v.69c.53-.55,1.2-.83,2-.83,.49,0,.92,.11,1.29,.32,.38,.21,.68,.5,.9,.87,.3-.39,.65-.69,1.05-.89,.4-.2,.85-.3,1.36-.3,.53,0,1,.12,1.39,.35,.4,.23,.71,.56,.94,.98,.23,.42,.34,.91,.34,1.46v4.48h-1.4v-4.24c0-.56-.15-1-.44-1.32-.29-.32-.69-.48-1.2-.48-.35,0-.66,.08-.94,.24-.28,.16-.52,.4-.73,.73,.02,.09,.03,.19,.04,.29,0,.1,.01,.21,.01,.31v4.48h-1.39v-4.24c0-.56-.15-1-.44-1.32-.29-.32-.69-.48-1.2-.48-.34,0-.64,.07-.91,.22s-.5,.36-.7,.65v5.18h-1.4Z" />
                                    <path class="d" d="M142.81,52.4c-.69,0-1.32-.16-1.88-.49-.56-.33-1.01-.77-1.34-1.33-.33-.56-.49-1.19-.49-1.88s.16-1.32,.49-1.88c.33-.56,.77-1.01,1.34-1.34,.56-.33,1.19-.5,1.88-.5s1.33,.17,1.89,.5c.56,.33,1,.78,1.33,1.34,.33,.56,.49,1.18,.49,1.88s-.16,1.32-.49,1.88c-.33,.56-.77,1-1.33,1.33-.56,.33-1.19,.49-1.89,.49Zm0-1.23c.44,0,.84-.11,1.19-.33,.36-.22,.63-.52,.84-.89,.21-.37,.31-.79,.31-1.26s-.11-.87-.31-1.24c-.21-.37-.49-.67-.84-.89-.35-.22-.74-.34-1.18-.34s-.83,.11-1.18,.34c-.35,.22-.63,.52-.84,.89-.21,.37-.31,.78-.31,1.24s.1,.89,.31,1.26c.21,.37,.48,.67,.84,.89,.35,.22,.75,.33,1.19,.33Z" />
                                    <path class="d" d="M148.48,52.26v-7.13h1.4v.91c.22-.34,.5-.6,.83-.79,.33-.19,.71-.29,1.13-.29,.29,0,.53,.05,.71,.13v1.26c-.13-.06-.27-.1-.41-.12-.14-.02-.28-.03-.42-.03-.41,0-.78,.11-1.09,.33-.32,.22-.57,.54-.76,.96v4.77h-1.4Z" />
                                    <path class="d" d="M157.31,52.39c-.7,0-1.33-.16-1.9-.49-.56-.33-1.01-.77-1.34-1.33-.33-.56-.5-1.18-.5-1.88s.16-1.3,.48-1.85,.75-1,1.29-1.33c.54-.33,1.14-.5,1.81-.5s1.25,.17,1.76,.5c.51,.33,.92,.78,1.23,1.34,.3,.57,.46,1.2,.46,1.91v.39h-5.61c.07,.39,.22,.74,.44,1.05,.22,.31,.5,.55,.84,.73,.34,.18,.71,.27,1.11,.27,.34,0,.68-.05,1-.16,.32-.11,.59-.26,.81-.47l.9,.88c-.42,.32-.85,.55-1.29,.71-.44,.15-.93,.23-1.46,.23Zm-2.32-4.28h4.21c-.06-.37-.18-.7-.38-.99-.2-.29-.45-.51-.74-.67-.29-.16-.61-.24-.96-.24s-.68,.08-.98,.24c-.3,.16-.55,.38-.75,.67-.2,.29-.33,.62-.4,1Z" />
                                    <path class="d" d="M166.47,42.25c1.15,.67,2.03,1.56,2.64,2.67s.92,2.38,.92,3.81-.31,2.7-.92,3.82-1.49,2-2.64,2.67l-.76-.9c.96-.58,1.7-1.35,2.21-2.31,.51-.96,.77-2.05,.77-3.28s-.26-2.3-.77-3.27c-.51-.97-1.25-1.73-2.21-2.3l.76-.91Z" />
                                </g>
                                <g class="arrow">
                                    <line class="e" x1="85.33" x2="85.33" y2="31.07" />
                                    <path class="d" d="M70.93,10.57c.7-.45,1.63-.24,2.07,.46l12.33,19.36,12.33-19.36c.45-.7,1.37-.91,2.07-.46,.7,.45,.9,1.38,.46,2.07l-13.59,21.34c-.28,.43-.75,.69-1.27,.69s-.99-.26-1.27-.69l-13.59-21.34c-.16-.25-.23-.53-.23-.81,0-.5,.25-.98,.69-1.27Z" />
                                </g>
                            </g>
                        </g>
                    </svg>
                    <svg class="hide-for-large" id="b" data-name="圖層 2" xmlns="http://www.w3.org/2000/svg" width="145.74" height="30" viewBox="0 0 145.74 30">
                        <g id="c" data-name="設計">
                            <g>
                                <g>
                                    <path d="M3.05,30c-.98-.58-1.74-1.34-2.26-2.29-.52-.95-.79-2.04-.79-3.26s.26-2.31,.79-3.27c.52-.96,1.28-1.72,2.26-2.29l.65,.77c-.82,.5-1.46,1.16-1.9,1.98-.44,.82-.66,1.76-.66,2.81s.22,1.97,.66,2.8,1.07,1.49,1.9,1.97l-.65,.78Z" style="fill: #0c131b;" />
                                    <path d="M11.35,27.54c-.67,0-1.32-.13-1.94-.4-.62-.26-1.18-.64-1.66-1.12l.77-.89c.46,.45,.92,.78,1.4,1,.48,.22,.97,.32,1.49,.32,.41,0,.77-.06,1.07-.17,.31-.12,.55-.28,.71-.5s.25-.46,.25-.73c0-.38-.13-.66-.4-.86-.26-.2-.7-.35-1.31-.46l-1.4-.23c-.77-.14-1.34-.38-1.72-.74-.38-.36-.57-.84-.57-1.44,0-.48,.13-.9,.38-1.27,.26-.36,.62-.65,1.09-.85,.47-.2,1.01-.3,1.63-.3s1.21,.1,1.79,.29,1.12,.48,1.59,.85l-.7,.96c-.9-.69-1.82-1.03-2.75-1.03-.37,0-.69,.05-.96,.16-.27,.1-.48,.25-.64,.44-.15,.19-.23,.41-.23,.65,0,.34,.12,.61,.35,.79,.23,.18,.62,.31,1.15,.39l1.36,.23c.89,.14,1.54,.4,1.96,.78s.62,.89,.62,1.55c0,.51-.14,.96-.42,1.35-.28,.39-.67,.69-1.18,.91-.5,.22-1.09,.32-1.75,.32Z" style="fill: #0c131b;" />
                                    <path d="M19.25,27.53c-.58,0-1.12-.14-1.6-.42-.48-.28-.86-.66-1.13-1.14-.28-.48-.41-1.02-.41-1.61s.14-1.13,.42-1.6c.28-.48,.66-.86,1.13-1.14s1.01-.43,1.59-.43c.46,0,.91,.09,1.34,.26,.43,.18,.8,.42,1.11,.74l-.74,.83c-.23-.26-.49-.45-.78-.58s-.59-.19-.9-.19c-.37,0-.7,.09-1,.28-.3,.18-.54,.44-.71,.76-.18,.32-.26,.68-.26,1.07s.09,.75,.26,1.07c.18,.32,.42,.57,.72,.76,.3,.19,.64,.28,1.02,.28,.31,0,.6-.06,.88-.19s.53-.31,.77-.55l.73,.77c-.32,.33-.69,.58-1.11,.76s-.86,.26-1.31,.26Z" style="fill: #0c131b;" />
                                    <path d="M23.17,27.42v-6.11h1.2v.78c.19-.29,.43-.51,.71-.68,.28-.16,.61-.25,.97-.25,.25,0,.45,.04,.61,.11v1.08c-.11-.05-.23-.08-.35-.1-.12-.02-.24-.03-.36-.03-.35,0-.66,.09-.94,.28-.27,.19-.49,.46-.65,.82v4.09h-1.2Z" style="fill: #0c131b;" />
                                    <path d="M30.72,27.54c-.59,0-1.13-.14-1.61-.42-.48-.28-.87-.66-1.15-1.14-.28-.48-.42-1.02-.42-1.61s.14-1.13,.42-1.61c.28-.48,.66-.86,1.15-1.15,.48-.28,1.02-.43,1.61-.43s1.14,.14,1.62,.43,.86,.67,1.14,1.15c.28,.48,.42,1.02,.42,1.61s-.14,1.13-.42,1.61c-.28,.48-.66,.86-1.14,1.14s-1.02,.42-1.62,.42Zm0-1.06c.38,0,.72-.09,1.02-.28,.3-.19,.54-.44,.72-.76,.18-.32,.26-.68,.26-1.08s-.09-.75-.27-1.06c-.18-.32-.42-.57-.72-.76-.3-.19-.64-.29-1.01-.29s-.71,.1-1.01,.29c-.3,.19-.54,.45-.72,.76-.18,.32-.27,.67-.27,1.06s.09,.76,.26,1.08c.18,.32,.42,.57,.72,.76,.3,.19,.64,.28,1.02,.28Z" style="fill: #0c131b;" />
                                    <path d="M35.58,27.42v-8.4l1.2-.23v8.63h-1.2Z" style="fill: #0c131b;" />
                                    <path d="M38.73,27.42v-8.4l1.2-.23v8.63h-1.2Z" style="fill: #0c131b;" />
                                    <path d="M47.55,27.53c-.59,0-1.04-.14-1.36-.41-.31-.28-.47-.68-.47-1.21v-3.59h-1.3v-1.01h1.3v-1.56l1.19-.29v1.85h1.8v1.01h-1.8v3.31c0,.31,.07,.53,.21,.67s.37,.2,.69,.2c.17,0,.32-.01,.45-.04,.13-.02,.27-.06,.43-.11v1.01c-.16,.06-.35,.1-.56,.13-.21,.03-.41,.04-.58,.04Z" style="fill: #0c131b;" />
                                    <path d="M52.94,27.54c-.59,0-1.13-.14-1.61-.42-.48-.28-.87-.66-1.15-1.14-.28-.48-.42-1.02-.42-1.61s.14-1.13,.42-1.61c.28-.48,.66-.86,1.15-1.15,.48-.28,1.02-.43,1.61-.43s1.14,.14,1.62,.43,.86,.67,1.14,1.15c.28,.48,.42,1.02,.42,1.61s-.14,1.13-.42,1.61c-.28,.48-.66,.86-1.14,1.14s-1.02,.42-1.62,.42Zm0-1.06c.38,0,.72-.09,1.02-.28,.3-.19,.54-.44,.72-.76,.18-.32,.26-.68,.26-1.08s-.09-.75-.27-1.06c-.18-.32-.42-.57-.72-.76-.3-.19-.64-.29-1.01-.29s-.71,.1-1.01,.29c-.3,.19-.54,.45-.72,.76-.18,.32-.27,.67-.27,1.06s.09,.76,.26,1.08c.18,.32,.42,.57,.72,.76,.3,.19,.64,.28,1.02,.28Z" style="fill: #0c131b;" />
                                    <path d="M63.78,27.53c-.6,0-1.14-.14-1.63-.42-.48-.28-.87-.66-1.15-1.14-.28-.48-.43-1.02-.43-1.61s.14-1.11,.41-1.59c.27-.48,.64-.86,1.1-1.14s.98-.43,1.55-.43,1.07,.14,1.51,.43,.79,.67,1.05,1.15c.26,.48,.39,1.03,.39,1.64v.34h-4.81c.06,.34,.19,.64,.38,.9,.19,.26,.43,.47,.72,.62,.29,.15,.61,.23,.95,.23,.3,0,.58-.05,.86-.14s.51-.23,.69-.4l.77,.76c-.36,.27-.73,.47-1.11,.61-.38,.13-.8,.2-1.25,.2Zm-1.99-3.67h3.61c-.05-.32-.16-.6-.33-.85-.17-.24-.38-.44-.64-.58-.25-.14-.53-.21-.82-.21s-.58,.07-.84,.2c-.26,.14-.47,.33-.64,.57s-.29,.53-.34,.86Z" style="fill: #0c131b;" />
                                    <path d="M67.15,27.42l2.38-3.13-2.28-2.98h1.4l1.57,2.09,1.57-2.09h1.36l-2.26,2.96,2.4,3.14h-1.4l-1.69-2.26-1.69,2.26h-1.36Z" style="fill: #0c131b;" />
                                    <path d="M74.58,29.87v-8.56h1.19v.59c.51-.46,1.14-.68,1.87-.68,.58,0,1.1,.14,1.57,.42,.47,.28,.84,.66,1.11,1.13,.27,.47,.41,1,.41,1.6s-.14,1.13-.41,1.6-.65,.85-1.12,1.13c-.47,.28-.99,.42-1.58,.42-.34,0-.66-.05-.97-.16-.31-.11-.6-.26-.86-.46v2.98h-1.2Zm2.9-3.4c.39,0,.74-.09,1.05-.28,.31-.18,.55-.43,.74-.75,.18-.32,.28-.67,.28-1.07s-.09-.76-.28-1.08-.43-.57-.74-.76c-.31-.18-.66-.28-1.05-.28-.34,0-.66,.06-.96,.19s-.54,.31-.74,.54v2.76c.2,.22,.45,.4,.75,.53,.3,.13,.62,.19,.95,.19Z" style="fill: #0c131b;" />
                                    <path d="M82.4,27.42v-8.4l1.2-.23v8.63h-1.2Z" style="fill: #0c131b;" />
                                    <path d="M88.46,27.54c-.59,0-1.13-.14-1.61-.42s-.87-.66-1.15-1.14c-.28-.48-.42-1.02-.42-1.61s.14-1.13,.42-1.61c.28-.48,.66-.86,1.15-1.15s1.02-.43,1.61-.43,1.14,.14,1.62,.43c.48,.28,.86,.67,1.14,1.15,.28,.48,.42,1.02,.42,1.61s-.14,1.13-.42,1.61c-.28,.48-.66,.86-1.14,1.14-.48,.28-1.02,.42-1.62,.42Zm0-1.06c.38,0,.72-.09,1.02-.28,.3-.19,.54-.44,.72-.76,.18-.32,.26-.68,.26-1.08s-.09-.75-.27-1.06c-.18-.32-.42-.57-.72-.76-.3-.19-.64-.29-1.01-.29s-.71,.1-1.01,.29c-.3,.19-.54,.45-.72,.76-.18,.32-.27,.67-.27,1.06s.09,.76,.26,1.08c.18,.32,.42,.57,.72,.76,.3,.19,.64,.28,1.02,.28Z" style="fill: #0c131b;" />
                                    <path d="M93.32,27.42v-6.11h1.2v.78c.19-.29,.43-.51,.71-.68s.61-.25,.97-.25c.25,0,.45,.04,.61,.11v1.08c-.11-.05-.23-.08-.35-.1-.12-.02-.24-.03-.36-.03-.35,0-.66,.09-.94,.28-.27,.19-.49,.46-.65,.82v4.09h-1.2Z" style="fill: #0c131b;" />
                                    <path d="M100.89,27.53c-.6,0-1.14-.14-1.63-.42-.48-.28-.87-.66-1.15-1.14-.28-.48-.43-1.02-.43-1.61s.14-1.11,.41-1.59c.27-.48,.64-.86,1.1-1.14,.46-.28,.98-.43,1.55-.43s1.07,.14,1.51,.43,.79,.67,1.05,1.15c.26,.48,.39,1.03,.39,1.64v.34h-4.81c.06,.34,.19,.64,.38,.9,.19,.26,.43,.47,.72,.62,.29,.15,.61,.23,.95,.23,.3,0,.58-.05,.86-.14s.51-.23,.69-.4l.77,.76c-.36,.27-.73,.47-1.11,.61s-.8,.2-1.25,.2Zm-1.99-3.67h3.61c-.05-.32-.16-.6-.33-.85s-.38-.44-.64-.58c-.25-.14-.53-.21-.82-.21s-.58,.07-.84,.2c-.26,.14-.47,.33-.64,.57-.17,.24-.29,.53-.34,.86Z" style="fill: #0c131b;" />
                                    <path d="M108.43,27.42v-6.11h1.2v.59c.46-.47,1.03-.71,1.72-.71,.42,0,.79,.09,1.11,.28,.32,.18,.58,.43,.77,.74,.26-.34,.56-.59,.9-.76,.34-.17,.73-.26,1.16-.26,.46,0,.85,.1,1.19,.3s.61,.48,.8,.84c.2,.36,.29,.78,.29,1.25v3.84h-1.2v-3.64c0-.48-.13-.86-.38-1.13-.25-.28-.59-.41-1.03-.41-.3,0-.56,.07-.8,.2-.24,.14-.45,.34-.62,.62,.02,.08,.03,.16,.04,.25,0,.09,.01,.18,.01,.26v3.84h-1.19v-3.64c0-.48-.13-.86-.38-1.13-.25-.28-.59-.41-1.03-.41-.29,0-.55,.06-.78,.19s-.43,.31-.6,.56v4.44h-1.2Z" style="fill: #0c131b;" />
                                    <path d="M122.41,27.54c-.59,0-1.13-.14-1.61-.42s-.87-.66-1.15-1.14c-.28-.48-.42-1.02-.42-1.61s.14-1.13,.42-1.61c.28-.48,.66-.86,1.15-1.15s1.02-.43,1.61-.43,1.14,.14,1.62,.43c.48,.28,.86,.67,1.14,1.15,.28,.48,.42,1.02,.42,1.61s-.14,1.13-.42,1.61c-.28,.48-.66,.86-1.14,1.14-.48,.28-1.02,.42-1.62,.42Zm0-1.06c.38,0,.72-.09,1.02-.28,.3-.19,.54-.44,.72-.76,.18-.32,.26-.68,.26-1.08s-.09-.75-.27-1.06c-.18-.32-.42-.57-.72-.76-.3-.19-.64-.29-1.01-.29s-.71,.1-1.01,.29c-.3,.19-.54,.45-.72,.76-.18,.32-.27,.67-.27,1.06s.09,.76,.26,1.08c.18,.32,.42,.57,.72,.76,.3,.19,.64,.28,1.02,.28Z" style="fill: #0c131b;" />
                                    <path d="M127.27,27.42v-6.11h1.2v.78c.19-.29,.43-.51,.71-.68s.61-.25,.97-.25c.25,0,.45,.04,.61,.11v1.08c-.11-.05-.23-.08-.35-.1-.12-.02-.24-.03-.36-.03-.35,0-.66,.09-.94,.28-.27,.19-.49,.46-.65,.82v4.09h-1.2Z" style="fill: #0c131b;" />
                                    <path d="M134.84,27.53c-.6,0-1.14-.14-1.63-.42-.48-.28-.87-.66-1.15-1.14-.28-.48-.43-1.02-.43-1.61s.14-1.11,.41-1.59c.27-.48,.64-.86,1.1-1.14,.46-.28,.98-.43,1.55-.43s1.07,.14,1.51,.43,.79,.67,1.05,1.15c.26,.48,.39,1.03,.39,1.64v.34h-4.81c.06,.34,.19,.64,.38,.9,.19,.26,.43,.47,.72,.62,.29,.15,.61,.23,.95,.23,.3,0,.58-.05,.86-.14s.51-.23,.69-.4l.77,.76c-.36,.27-.73,.47-1.11,.61s-.8,.2-1.25,.2Zm-1.99-3.67h3.61c-.05-.32-.16-.6-.33-.85s-.38-.44-.64-.58c-.25-.14-.53-.21-.82-.21s-.58,.07-.84,.2c-.26,.14-.47,.33-.64,.57-.17,.24-.29,.53-.34,.86Z" style="fill: #0c131b;" />
                                    <path d="M142.69,18.84c.98,.58,1.74,1.34,2.26,2.29,.52,.95,.79,2.04,.79,3.26s-.26,2.31-.79,3.27c-.52,.96-1.28,1.72-2.26,2.29l-.65-.77c.82-.5,1.46-1.16,1.9-1.98,.44-.82,.66-1.76,.66-2.81s-.22-1.97-.66-2.8c-.44-.83-1.07-1.49-1.9-1.97l.65-.78Z" style="fill: #0c131b;" />
                                </g>
                                <g>
                                    <line x1="73.14" x2="73.14" y2="14.4" style="fill: none; stroke: #0c131b; stroke-miterlimit: 10; stroke-width: 1.5px;" />
                                    <path d="M65.94,4.14c.35-.22,.81-.12,1.04,.23l6.16,9.68,6.16-9.68c.22-.35,.69-.45,1.04-.23s.45,.69,.23,1.04l-6.8,10.67c-.14,.22-.38,.35-.63,.35s-.5-.13-.63-.35l-6.8-10.67c-.08-.13-.12-.27-.12-.4,0-.25,.12-.49,.35-.63Z" style="fill: #0c131b;" />
                                </g>
                            </g>
                        </g>
                    </svg>
                </div>
            </div>
        </div>
        <div class="new-drinkWrap flex-container align-center">
            <div class="title">
                <div class="ch">最新饮品</div>
                <div class="en">
                    NEW<br>
                    DRINKS
                </div>
            </div>
            <ul class="pic">
                <li> <img src="./images/t-new-drink-center.png" alt=""></li>
                <li> <img src="./images/t-new-drink-center-2.png" alt=""></li>
                <li> <img src="./images/t-new-drink-center.png" alt=""></li>
            </ul>
            <ul class="new-drink">
                <li data-drink="1" class="current">
                    <div class="inner">
                        <div class="region">/ CHINA</div>
                        <div class="ch">香栗波霸奶茶</div>
                        <div class="en">Jumbo Chestnut Milk Tea</div>
                    </div>
                </li>
                <li data-drink="2">
                    <div class="inner">
                        <div class="region">/ CHINA</div>
                        <div class="ch">柿柿如意果绿</div>
                        <div class="en">Persimmon Green Tea</div>
                    </div>
                </li>
                <li data-drink="3">
                    <div class="inner">
                        <div class="region">/ CHINA</div>
                        <div class="ch">芋泥米香奶茶</div>
                        <div class="en">Taro Ricey Milk Tea</div>
                    </div>
                </li>
            </ul>
        </div>
        <div class="drinkWrap">
            <div class="menu-mobileListWrap hide-for-large">
                <div class="menu">
                    <a href="./menu.php"><img src="./images/menu-link-mobile.svg" alt=""></a>
                </div>
                <div class="menu-select">
                    <span class="current">
                        Drink Classification
                        飲品分類
                    </span>
                    <ul class="list">
                        <li class="option selected">
                            Drink Classification
                            飲品分類
                        </li>
                        <li class="option" data-menu="0">
                            地区限定
                        </li>
                        <li class="option" data-menu="1">
                            原味茶系列
                        </li>
                        <li class="option" data-menu="2">
                            奶茶系列
                        </li>
                        <li class="option" data-menu="3">
                            果汁系列
                        </li>
                    </ul>
                </div>
            </div>
            <ul class="drinkWrapList">
                <li data-where="0" class="drink-mobile-1">
                    <div class="title">
                        <div class="ch">地区限定</div>
                        <div class="en">
                            AREA<br>
                            EXCLUSIVE
                        </div>
                    </div>
                    <div class="drink-changeList">
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="region">/ CHINA</div>
                                <div class="ch">荞麦茶拿铁</div>
                                <div class="en">Buckwheat Tea Latte</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="2">
                                <div class="region">/ CHINA</div>
                                <div class="ch">芋泥米香奶茶</div>
                                <div class="en">Taro Ricey Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="3">
                                <div class="region">/ JAPAN</div>
                                <div class="ch">草莓茉莉绿茶</div>
                                <div class="en">Strawberry Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="4">
                                <div class="region">/ MALAYSIA</div>
                                <div class="ch">黑熔岩奶茶</div>
                                <div class="en">Dark Lava Milk Tea </div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="5">
                                <div class="region">/ CHINA</div>
                                <div class="ch">草莓乳酪奶绿</div>
                                <div class="en">Strawberry Cheesy Green Tea</div>
                                <div class="content show-for-large">一起喝草莓 ! 快乐“莓”烦恼，酸甜丰富口感，抚慰内心小烦躁 !</div>
                            </li>
                            <li data-drink="6">
                                <div class="region">/ CHINA</div>
                                <div class="ch">芋泥米香拿铁</div>
                                <div class="en">Taro Ricey Tea Latte</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="7">
                                <div class="region">/ JAPAN</div>
                                <div class="ch">水蜜桃乳酪奶绿</div>
                                <div class="en">Peach Cheesy Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="8">
                                <div class="region">/ MALAYSIA</div>
                                <div class="ch">芋泥米香拿铁</div>
                                <div class="en">Taro Ricey Tea Latte</div>
                                <div class="content show-for-large">添加令人著迷的巧克力醬和巧克力小麥脆脆，滿足對甜食的渴望~</div>
                            </li>
                        </ul>
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="region">/ CHINA</div>
                                <div class="ch">草莓乳酪奶绿</div>
                                <div class="en">Strawberry Cheesy Green Tea</div>
                                <div class="content show-for-large">一起喝草莓 ! 快乐“莓”烦恼，酸甜丰富口感，抚慰内心小烦躁 !</div>
                            </li>
                            <li data-drink="2">
                                <div class="region">/ CHINA</div>
                                <div class="ch">芋泥米香拿铁</div>
                                <div class="en">Taro Ricey Tea Latte</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="3">
                                <div class="region">/ JAPAN</div>
                                <div class="ch">水蜜桃乳酪奶绿</div>
                                <div class="en">Peach Cheesy Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="4">
                                <div class="region">/ MALAYSIA</div>
                                <div class="ch">芋泥米香拿铁</div>
                                <div class="en">Taro Ricey Tea Latte</div>
                                <div class="content show-for-large">添加令人著迷的巧克力醬和巧克力小麥脆脆，滿足對甜食的渴望~</div>
                            </li>
                            <li data-drink="5">
                                <div class="region">/ CHINA</div>
                                <div class="ch">荞麦茶拿铁</div>
                                <div class="en">Buckwheat Tea Latte</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="6">
                                <div class="region">/ CHINA</div>
                                <div class="ch">芋泥米香奶茶</div>
                                <div class="en">Taro Ricey Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="7">
                                <div class="region">/ JAPAN</div>
                                <div class="ch">草莓茉莉绿茶</div>
                                <div class="en">Strawberry Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="8">
                                <div class="region">/ MALAYSIA</div>
                                <div class="ch">黑熔岩奶茶</div>
                                <div class="en">Dark Lava Milk Tea </div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                        </ul>
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="region">/ CHINA</div>
                                <div class="ch">荞麦茶拿铁</div>
                                <div class="en">Buckwheat Tea Latte</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="2">
                                <div class="region">/ CHINA</div>
                                <div class="ch">芋泥米香奶茶</div>
                                <div class="en">Taro Ricey Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="3">
                                <div class="region">/ JAPAN</div>
                                <div class="ch">草莓茉莉绿茶</div>
                                <div class="en">Strawberry Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="4">
                                <div class="region">/ MALAYSIA</div>
                                <div class="ch">黑熔岩奶茶</div>
                                <div class="en">Dark Lava Milk Tea </div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="5">
                                <div class="region">/ CHINA</div>
                                <div class="ch">草莓乳酪奶绿</div>
                                <div class="en">Strawberry Cheesy Green Tea</div>
                                <div class="content show-for-large">一起喝草莓 ! 快乐“莓”烦恼，酸甜丰富口感，抚慰内心小烦躁 !</div>
                            </li>
                            <li data-drink="6">
                                <div class="region">/ CHINA</div>
                                <div class="ch">芋泥米香拿铁</div>
                                <div class="en">Taro Ricey Tea Latte</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="7">
                                <div class="region">/ JAPAN</div>
                                <div class="ch">水蜜桃乳酪奶绿</div>
                                <div class="en">Peach Cheesy Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="8">
                                <div class="region">/ MALAYSIA</div>
                                <div class="ch">芋泥米香拿铁</div>
                                <div class="en">Taro Ricey Tea Latte</div>
                                <div class="content show-for-large">添加令人著迷的巧克力醬和巧克力小麥脆脆，滿足對甜食的渴望~</div>
                            </li>
                        </ul>
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="region">/ CHINA</div>
                                <div class="ch">草莓乳酪奶绿</div>
                                <div class="en">Strawberry Cheesy Green Tea</div>
                                <div class="content show-for-large">一起喝草莓 ! 快乐“莓”烦恼，酸甜丰富口感，抚慰内心小烦躁 !</div>
                            </li>
                            <li data-drink="2">
                                <div class="region">/ CHINA</div>
                                <div class="ch">芋泥米香拿铁</div>
                                <div class="en">Taro Ricey Tea Latte</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="3">
                                <div class="region">/ JAPAN</div>
                                <div class="ch">水蜜桃乳酪奶绿</div>
                                <div class="en">Peach Cheesy Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="4">
                                <div class="region">/ MALAYSIA</div>
                                <div class="ch">芋泥米香拿铁</div>
                                <div class="en">Taro Ricey Tea Latte</div>
                                <div class="content show-for-large">添加令人著迷的巧克力醬和巧克力小麥脆脆，滿足對甜食的渴望~</div>
                            </li>
                            <li data-drink="5">
                                <div class="region">/ CHINA</div>
                                <div class="ch">荞麦茶拿铁</div>
                                <div class="en">Buckwheat Tea Latte</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="6">
                                <div class="region">/ CHINA</div>
                                <div class="ch">芋泥米香奶茶</div>
                                <div class="en">Taro Ricey Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="7">
                                <div class="region">/ JAPAN</div>
                                <div class="ch">草莓茉莉绿茶</div>
                                <div class="en">Strawberry Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="8">
                                <div class="region">/ MALAYSIA</div>
                                <div class="ch">黑熔岩奶茶</div>
                                <div class="en">Dark Lava Milk Tea </div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                        </ul>
                    </div>
                </li>
                <li data-where="1" class="drink-mobile-2">
                    <div class="title">
                        <div class="ch">原味茶系列</div>
                        <div class="en">
                            FLAVORED<br>
                            TEA
                        </div>
                        <div class="icon"><img src="./images/index-drink-icon-1.svg" alt=""></div>
                    </div>
                    <div class="drink-changeList">
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="ch">茉莉绿茶</div>
                                <div class="en">Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">阿萨姆红茶</div>
                                <div class="en">Black Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">黄金乌龙茶</div>
                                <div class="en">Golden Oolong Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="4">
                                <div class="ch">黑熔岩奶茶</div>
                                <div class="en">Dark Lava Milk Tea </div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="5">
                                <div class="ch">水蜜桃绿茶</div>
                                <div class="en">Peach Green Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="6">
                                <div class="ch">金桔柠檬绿茶</div>
                                <div class="en">Lemon Lime Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="7">
                                <div class="ch">百香果鲜果绿茶</div>
                                <div class="en">Passion Fruit Green Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="8">
                                <div class="ch">荔枝红茶</div>
                                <div class="en">Lychee Black Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                        </ul>
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="ch">茉莉绿茶</div>
                                <div class="en">Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="5">
                                <div class="ch">水蜜桃绿茶</div>
                                <div class="en">Peach Green Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">阿萨姆红茶</div>
                                <div class="en">Black Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="6">
                                <div class="ch">金桔柠檬绿茶</div>
                                <div class="en">Lemon Lime Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">黄金乌龙茶</div>
                                <div class="en">Golden Oolong Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="7">
                                <div class="ch">百香果鲜果绿茶</div>
                                <div class="en">Passion Fruit Green Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="4">
                                <div class="ch">黑熔岩奶茶</div>
                                <div class="en">Dark Lava Milk Tea </div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="8">
                                <div class="ch">荔枝红茶</div>
                                <div class="en">Lychee Black Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                        </ul>
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="ch">茉莉绿茶</div>
                                <div class="en">Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">阿萨姆红茶</div>
                                <div class="en">Black Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">黄金乌龙茶</div>
                                <div class="en">Golden Oolong Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="4">
                                <div class="ch">黑熔岩奶茶</div>
                                <div class="en">Dark Lava Milk Tea </div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="5">
                                <div class="ch">水蜜桃绿茶</div>
                                <div class="en">Peach Green Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="6">
                                <div class="ch">金桔柠檬绿茶</div>
                                <div class="en">Lemon Lime Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="7">
                                <div class="ch">百香果鲜果绿茶</div>
                                <div class="en">Passion Fruit Green Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="8">
                                <div class="ch">荔枝红茶</div>
                                <div class="en">Lychee Black Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                        </ul>
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="ch">茉莉绿茶</div>
                                <div class="en">Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="5">
                                <div class="ch">水蜜桃绿茶</div>
                                <div class="en">Peach Green Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">阿萨姆红茶</div>
                                <div class="en">Black Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="6">
                                <div class="ch">金桔柠檬绿茶</div>
                                <div class="en">Lemon Lime Green Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">黄金乌龙茶</div>
                                <div class="en">Golden Oolong Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="7">
                                <div class="ch">百香果鲜果绿茶</div>
                                <div class="en">Passion Fruit Green Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="4">
                                <div class="ch">黑熔岩奶茶</div>
                                <div class="en">Dark Lava Milk Tea </div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="8">
                                <div class="ch">荔枝红茶</div>
                                <div class="en">Lychee Black Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                        </ul>
                    </div>
                </li>
                <li data-where="2" class="drink-mobile-3">
                    <div class="title">
                        <div class="ch">奶茶系列</div>
                        <div class="en">
                            MILK TEA
                        </div>
                        <div class="icon"><img src="./images/index-drink-icon-2.svg" alt=""></div>
                    </div>
                    <div class="drink-changeList">
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="ch">奶茶</div>
                                <div class="en">Milk Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">黄金珍奶</div>
                                <div class="en">Golden Bubble Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">乌龙奶茶</div>
                                <div class="en">Oolong Milk Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="4">
                                <div class="ch">榛果奶茶</div>
                                <div class="en">Hazelnut Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="5">
                                <div class="ch">焦糖奶茶</div>
                                <div class="en">Caramel Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="6">
                                <div class="ch">巧克力奶茶</div>
                                <div class="en">Chocolate Milk</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie</div>
                            </li>
                            <li data-drink="7">
                                <div class="ch">蜂蜜奶茶</div>
                                <div class="en">Honey Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="8">
                                <div class="ch">鲜奶绿茶</div>
                                <div class="en">Green Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                        </ul>
                        <ul class="drinkList">
                            <li data-drink="5">
                                <div class="ch">焦糖奶茶</div>
                                <div class="en">Caramel Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="6">
                                <div class="ch">巧克力奶茶</div>
                                <div class="en">Chocolate Milk</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie</div>
                            </li>
                            <li data-drink="7">
                                <div class="ch">蜂蜜奶茶</div>
                                <div class="en">Honey Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="8">
                                <div class="ch">鲜奶绿茶</div>
                                <div class="en">Green Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="1">
                                <div class="ch">奶茶</div>
                                <div class="en">Milk Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">黄金珍奶</div>
                                <div class="en">Golden Bubble Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">乌龙奶茶</div>
                                <div class="en">Oolong Milk Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="4">
                                <div class="ch">榛果奶茶</div>
                                <div class="en">Hazelnut Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>

                        </ul>
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="ch">奶茶</div>
                                <div class="en">Milk Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">黄金珍奶</div>
                                <div class="en">Golden Bubble Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">乌龙奶茶</div>
                                <div class="en">Oolong Milk Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="4">
                                <div class="ch">榛果奶茶</div>
                                <div class="en">Hazelnut Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="5">
                                <div class="ch">焦糖奶茶</div>
                                <div class="en">Caramel Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="6">
                                <div class="ch">巧克力奶茶</div>
                                <div class="en">Chocolate Milk</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie</div>
                            </li>
                            <li data-drink="7">
                                <div class="ch">蜂蜜奶茶</div>
                                <div class="en">Honey Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="8">
                                <div class="ch">鲜奶绿茶</div>
                                <div class="en">Green Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                        </ul>
                        <ul class="drinkList">
                            <li data-drink="5">
                                <div class="ch">焦糖奶茶</div>
                                <div class="en">Caramel Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="6">
                                <div class="ch">巧克力奶茶</div>
                                <div class="en">Chocolate Milk</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie</div>
                            </li>
                            <li data-drink="7">
                                <div class="ch">蜂蜜奶茶</div>
                                <div class="en">Honey Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="8">
                                <div class="ch">鲜奶绿茶</div>
                                <div class="en">Green Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>
                            <li data-drink="1">
                                <div class="ch">奶茶</div>
                                <div class="en">Milk Tea</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">黄金珍奶</div>
                                <div class="en">Golden Bubble Milk Tea</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">乌龙奶茶</div>
                                <div class="en">Oolong Milk Tea</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="4">
                                <div class="ch">榛果奶茶</div>
                                <div class="en">Hazelnut Milk Tea</div>
                                <div class="content show-for-large">添加令人着迷的巧克力酱和巧克力小麦脆脆，满足对甜食的渴望~</div>
                            </li>

                        </ul>
                    </div>
                </li>
                <li data-where="3" class="drink-mobile-4">
                    <div class="title">
                        <div class="ch">果汁系列</div>
                        <div class="en">
                            JUICE
                        </div>
                        <div class="icon"><img src="./images/index-drink-icon-5.svg" alt=""></div>
                    </div>
                    <div class="drink-changeList">
                        <ul class="drinkList">
                            <li data-drink="4">
                                <div class="ch">葡萄柚汁</div>
                                <div class="en">Grapefruit Juice</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">柠檬梅子汁</div>
                                <div class="en">Lemon Plum Juice</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">八冰茶</div>
                                <div class="en">No.8 Juice</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="4">
                                <div class="ch">葡萄柚汁</div>
                                <div class="en">Grapefruit Juice</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="5">
                                <div class="ch">柠檬梅子汁</div>
                                <div class="en">Lemon Plum Juice</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="6">
                                <div class="ch">八冰茶</div>
                                <div class="en">No.8 Juice</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                            <li data-drink="7">
                                <div class="ch">葡萄柚汁</div>
                                <div class="en">Grapefruit Juice</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="8">
                                <div class="ch">柠檬梅子汁</div>
                                <div class="en">Lemon Plum Juice</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                        </ul>
                        <ul class="drinkList">
                            <li data-drink="1">
                                <div class="ch">葡萄柚汁</div>
                                <div class="en">Grapefruit Juice</div>
                                <div class="content show-for-large">茉莉绿茶的浓郁茶叶香气与草莓的颗粒感受酸甜口感，喝一口心旷神怡!</div>
                            </li>
                            <li data-drink="2">
                                <div class="ch">柠檬梅子汁</div>
                                <div class="en">Lemon Plum Juice</div>
                                <div class="content show-for-large">嚼得到的芋头颗粒配上软滑细腻米香奶冻，明天约上Homie一起Citywalk</div>
                            </li>
                            <li data-drink="3">
                                <div class="ch">八冰茶</div>
                                <div class="en">No.8 Juice</div>
                                <div class="content show-for-large">选用颗粒饱满苦荞冲泡的汤色纯洁明亮，融合纯牛奶，口感舒适香醇双口</div>
                            </li>
                        </ul>
                    </div>
                </li>
            </ul>
            <div class="menu-drinkList show-for-large">
                <div class="menu">
                    <a href="./menu.php">
                        <svg id="b" data-name="圖層 2" xmlns="http://www.w3.org/2000/svg" width="91.72" height="91.72" viewBox="0 0 91.72 91.72">
                            <g id="c" data-name="設計">
                                <circle cx="45.86" cy="45.86" r="45.86" />
                                <g class="arrow">
                                    <rect class="d" x="45.06" y="59.71" width="1.62" height="16.83" />
                                    <path class="d" d="M38.07,65.43c.38-.24,.88-.13,1.12,.25l6.68,10.48,6.68-10.48c.24-.38,.74-.49,1.12-.25s.49,.75,.25,1.12l-7.36,11.56c-.15,.23-.41,.38-.69,.38s-.54-.14-.69-.38l-7.36-11.56c-.09-.14-.13-.29-.13-.44,0-.27,.13-.53,.38-.69Z" />
                                </g>
                                <g>
                                    <path class="d" d="M25.68,34.96v-10.5h3.25l2.59,4.95,2.6-4.95h3.25v10.5h-2.43v-7.16l-3.45,6.41-3.45-6.43v7.18h-2.37Z" />
                                    <path class="d" d="M43.33,35.12c-.81,0-1.54-.18-2.2-.55-.66-.37-1.17-.86-1.55-1.48s-.57-1.31-.57-2.08,.18-1.46,.55-2.08,.86-1.11,1.49-1.48,1.33-.55,2.1-.55,1.47,.19,2.07,.56c.6,.38,1.07,.89,1.42,1.54,.34,.65,.52,1.39,.52,2.23v.6h-5.66c.11,.25,.26,.47,.44,.66,.19,.19,.41,.34,.67,.44,.26,.1,.54,.16,.84,.16,.33,0,.63-.05,.9-.16,.27-.11,.5-.25,.69-.44l1.61,1.42c-.5,.42-1.01,.72-1.54,.92-.52,.19-1.12,.29-1.78,.29Zm-1.88-4.98h3.32c-.08-.26-.2-.48-.37-.67-.17-.19-.36-.33-.58-.44-.22-.1-.46-.16-.72-.16s-.52,.05-.74,.15c-.22,.1-.41,.24-.56,.43-.16,.19-.27,.41-.35,.68Z" />
                                    <path class="d" d="M48.67,34.96v-7.93h2.43v.54c.6-.46,1.31-.69,2.13-.69,.62,0,1.17,.13,1.64,.41,.48,.27,.85,.64,1.12,1.12,.27,.48,.4,1.04,.4,1.67v4.89h-2.43v-4.56c0-.44-.13-.79-.39-1.05-.26-.26-.61-.39-1.05-.39-.31,0-.58,.05-.82,.17-.23,.11-.44,.26-.61,.46v5.37h-2.43Z" />
                                    <path class="d" d="M61.24,35.12c-.62,0-1.17-.14-1.64-.41-.48-.27-.85-.65-1.12-1.13-.27-.48-.4-1.04-.4-1.66v-4.89h2.43v4.56c0,.43,.13,.78,.4,1.04s.61,.4,1.04,.4c.31,0,.58-.06,.83-.17,.24-.11,.44-.27,.6-.47v-5.37h2.43v7.93h-2.43v-.54c-.6,.46-1.31,.69-2.13,.69Z" />
                                    <path class="d" d="M8.62,51.96v-10.5h4.26c.78,0,1.5,.13,2.17,.41,.67,.27,1.26,.64,1.76,1.12,.5,.48,.9,1.04,1.19,1.68,.28,.64,.43,1.33,.43,2.07s-.14,1.41-.43,2.04c-.29,.63-.68,1.18-1.19,1.66s-1.09,.85-1.76,1.12c-.67,.27-1.39,.41-2.17,.41h-4.26Zm2.58-2.28h1.62c.41,0,.79-.08,1.15-.22,.35-.15,.67-.36,.94-.63,.27-.27,.48-.58,.63-.94,.15-.36,.22-.74,.22-1.15s-.08-.81-.22-1.18c-.15-.37-.36-.68-.63-.95s-.58-.48-.94-.64c-.36-.16-.74-.23-1.15-.23h-1.62v5.94Z" />
                                    <path class="d" d="M23.99,52.12c-.81,0-1.54-.18-2.19-.55s-1.17-.86-1.54-1.48-.57-1.31-.57-2.08,.19-1.47,.57-2.09,.89-1.12,1.54-1.48,1.38-.55,2.19-.55,1.54,.18,2.19,.55,1.17,.86,1.54,1.48,.57,1.32,.57,2.09-.19,1.46-.57,2.08-.89,1.11-1.54,1.48-1.38,.55-2.19,.55Zm0-2.1c.37,0,.7-.09,.99-.27,.29-.18,.52-.42,.69-.73s.25-.64,.25-1.01-.08-.72-.25-1.03-.4-.55-.7-.73-.62-.27-.98-.27-.69,.09-.98,.27c-.3,.18-.53,.42-.7,.73s-.25,.65-.25,1.03,.08,.71,.25,1.01,.4,.55,.7,.73c.29,.18,.62,.27,.98,.27Z" />
                                    <path class="d" d="M31.19,51.96l-2.16-7.93h2.29l1.17,4.67,1.42-4.67h2.01l1.43,4.68,1.15-4.68h2.27l-2.17,7.93h-2.33l-1.38-4.59-1.37,4.59h-2.34Z" />
                                    <path class="d" d="M42.02,51.96v-7.93h2.43v.54c.6-.46,1.31-.69,2.13-.69,.62,0,1.17,.13,1.64,.41,.48,.27,.85,.64,1.12,1.12,.27,.48,.4,1.04,.4,1.67v4.89h-2.43v-4.56c0-.44-.13-.79-.39-1.05-.26-.26-.61-.39-1.05-.39-.31,0-.58,.05-.82,.17-.23,.11-.44,.26-.61,.46v5.37h-2.43Z" />
                                    <path class="d" d="M51.56,51.96v-10.5l2.43-.38v10.88h-2.43Z" />
                                    <path class="d" d="M59.81,52.12c-.81,0-1.54-.18-2.19-.55s-1.17-.86-1.54-1.48-.57-1.31-.57-2.08,.19-1.47,.57-2.09,.89-1.12,1.54-1.48,1.38-.55,2.19-.55,1.54,.18,2.19,.55,1.17,.86,1.54,1.48,.57,1.32,.57,2.09-.19,1.46-.57,2.08-.89,1.11-1.54,1.48-1.38,.55-2.19,.55Zm0-2.1c.37,0,.7-.09,.99-.27,.29-.18,.52-.42,.69-.73s.25-.64,.25-1.01-.08-.72-.25-1.03-.4-.55-.7-.73-.62-.27-.98-.27-.69,.09-.98,.27c-.3,.18-.53,.42-.7,.73s-.25,.65-.25,1.03,.08,.71,.25,1.01,.4,.55,.7,.73c.29,.18,.62,.27,.98,.27Z" />
                                    <path class="d" d="M68.24,52.1c-.56,0-1.06-.1-1.49-.31-.44-.21-.78-.5-1.02-.87s-.37-.79-.37-1.28c0-.76,.29-1.35,.86-1.76,.58-.41,1.38-.62,2.41-.62,.62,0,1.22,.08,1.8,.22v-.39c0-.4-.13-.7-.38-.89s-.63-.29-1.13-.29c-.31,0-.66,.05-1.04,.15-.39,.1-.84,.26-1.36,.48l-.87-1.79c.65-.29,1.28-.51,1.88-.65,.61-.15,1.21-.22,1.82-.22,1.1,0,1.96,.26,2.57,.79,.61,.53,.92,1.26,.92,2.21v5.08h-2.4v-.48c-.32,.22-.66,.38-1.01,.47-.36,.1-.75,.14-1.18,.14Zm-.57-2.5c0,.25,.11,.45,.33,.58,.22,.14,.53,.21,.92,.21,.29,0,.56-.03,.82-.09s.49-.16,.7-.29v-1.02c-.23-.06-.46-.11-.71-.14-.24-.03-.48-.04-.73-.04-.42,0-.75,.07-.98,.2-.23,.13-.34,.33-.34,.58Z" />
                                    <path class="d" d="M78.34,52.07c-.75,0-1.43-.18-2.05-.55s-1.1-.86-1.46-1.47c-.36-.62-.54-1.3-.54-2.06s.18-1.45,.55-2.06c.37-.62,.86-1.1,1.49-1.46,.62-.36,1.32-.54,2.09-.54,.37,0,.73,.04,1.07,.13s.66,.22,.96,.39v-2.99l2.43-.38v10.88h-2.4v-.58c-.63,.46-1.34,.69-2.13,.69Zm.42-2.07c.34,0,.65-.05,.93-.16,.28-.11,.53-.26,.75-.47v-2.78c-.21-.2-.46-.35-.75-.46-.29-.11-.6-.16-.93-.16-.39,0-.74,.09-1.06,.26-.32,.17-.57,.42-.75,.72-.19,.31-.28,.65-.28,1.03s.09,.72,.28,1.03c.18,.3,.43,.54,.75,.72,.31,.17,.67,.26,1.06,.26Z" />
                                </g>
                            </g>
                        </svg>
                    </a>
                </div>
                <ul class="drink-fixedList">
                    <li data-scroll="1" class="flex-container align-middle current">
                        <div class="dot"></div>
                        <div class="title">地区限定</div>
                    </li>
                    <li data-scroll="2" class="flex-container align-middle">
                        <div class="dot"></div>
                        <div class="title">原味茶系列</div>
                    </li>
                    <li data-scroll="3" class="flex-container align-middle">
                        <div class="dot"></div>
                        <div class="title">奶茶系列</div>
                    </li>
                    <li data-scroll="4" class="flex-container align-middle">
                        <div class="dot"></div>
                        <div class="title">果汁系列</div>
                    </li>
                </ul>
            </div>
            <div class="drinkList-pic">
                <ul class="area-1">
                    <li class="is-show"><img src="./images/t-drink-pic-1.jpg"></li>
                    <li><img src="./images/t-drink-pic-2.jpg"></li>
                    <li><img src="./images/t-drink-pic-3.jpg"></li>
                    <li><img src="./images/t-drink-pic-4.jpg"></li>
                    <li><img src="./images/t-drink-pic-1.jpg"></li>
                    <li><img src="./images/t-drink-pic-2.jpg"></li>
                    <li><img src="./images/t-drink-pic-3.jpg"></li>
                    <li><img src="./images/t-drink-pic-4.jpg"></li>
                </ul>
                <ul class="area-2">
                    <li class="is-show"><img src="./images/t-drink-pic-2.jpg" alt=""></li>
                    <li><img src="./images/t-drink-pic-3.jpg"></li>
                    <li><img src="./images/t-drink-pic-4.jpg"></li>
                    <li><img src="./images/t-drink-pic-1.jpg"></li>
                    <li><img src="./images/t-drink-pic-2.jpg"></li>
                    <li><img src="./images/t-drink-pic-3.jpg"></li>
                    <li><img src="./images/t-drink-pic-4.jpg"></li>
                    <li><img src="./images/t-drink-pic-1.jpg"></li>
                </ul>
                <ul class="area-3">
                    <li class="is-show"><img src="./images/t-drink-pic-3.jpg" alt=""></li>
                    <li><img src="./images/t-drink-pic-4.jpg"></li>
                    <li><img src="./images/t-drink-pic-1.jpg"></li>
                    <li><img src="./images/t-drink-pic-2.jpg"></li>
                    <li><img src="./images/t-drink-pic-3.jpg"></li>
                    <li><img src="./images/t-drink-pic-4.jpg"></li>
                    <li><img src="./images/t-drink-pic-1.jpg"></li>
                    <li><img src="./images/t-drink-pic-2.jpg"></li>
                </ul>
                <ul class="area-4">
                    <li class="is-show"><img src="./images/t-drink-pic-4.jpg" alt=""></li>
                    <li><img src="./images/t-drink-pic-1.jpg"></li>
                    <li><img src="./images/t-drink-pic-2.jpg"></li>
                    <li><img src="./images/t-drink-pic-3.jpg"></li>
                    <li><img src="./images/t-drink-pic-4.jpg"></li>
                    <li><img src="./images/t-drink-pic-1.jpg"></li>
                    <li><img src="./images/t-drink-pic-2.jpg"></li>
                    <li><img src="./images/t-drink-pic-3.jpg"></li>
                </ul>
            </div>
        </div>
    </div>
    <?php include 'footer.php'; ?>
</body>
<?php include 'script.php'; ?>

</html>

<script>
    $('footer').addClass('is-white');
    let $tl_title = gsap.timeline({
            paused: true,
        })
        .to(".head-area .en", {
            duration: 1,
            y: 0,
            rotation: 0,
            ease: Power2.easeOut,
        })

    gsap.delayedCall(1, function() {
        $tl_title.play();
    });

    function getRandomInt(max) {
        return Math.floor(Math.random() * max);
    }
    var transitionArray = ['slideLeft', 'slideRight', 'slideUp', 'slideDown']
    $(".drinkListWrap").vegas({
        timer: false,
        autoplay: true,
        delay: 3000,
        transitionDuration: 500,
        slides: [{
                src: "./images/t-top-bg-1.jpg"
            },
            {
                src: "./images/t-top-bg-2.jpg"
            },
            {
                src: "./images/t-top-bg-3.jpg"
            },
            {
                src: "./images/t-top-bg-4.jpg"
            }
        ],
        transition: [transitionArray[getRandomInt(4)], transitionArray[getRandomInt(4)], transitionArray[getRandomInt(4)], transitionArray[getRandomInt(4)]]
    });

    $(".new-drinkWrap").vegas({
        timer: false,
        autoplay: false,
        // delay: 2000,
        transitionDuration: 1000,
        slides: [{
                src: "./images/t-new-drink-bg.jpg"
            }, {
                src: "./images/t-new-drink-bg-2.jpg"
            },
            {
                src: "./images/t-new-drink-bg.jpg"
            }
        ],
    });
    $('.new-drinkWrap .pic').slick({
        dots: false,
        speed: 1500,
        slidesToShow: 1,
        slidesToScroll: 1,
        fade: true,
        autoplay: true,
        prevArrow: false,
        nextArrow: false,
    });

    $('.new-drinkWrap .pic').on('beforeChange', function(event, slick, currentSlide, nextSlide) {
        // console.log(nextSlide);
        $(".new-drinkWrap").vegas('jump', nextSlide);
        if (window.device == 'desktop') {
            $(`.new-drink li:nth-child(${nextSlide + 1})`).addClass('current').siblings().removeClass('current');
        } else {
            $('.new-drink').slick('slickGoTo', nextSlide);
        }
    });
    if (window.device == 'desktop') {
        $('.new-drink li:nth-child(1)').addClass('current');

        var clickLock = false;

        $('.new-drink li[data-drink]').click(function(e) {
            e.preventDefault();
            if (clickLock) return;
            clickLock = true;

            var slideDrink = $(this).data('drink');
            $(this).addClass('current').siblings().removeClass('current');
            $('.new-drinkWrap .pic').slick('slickGoTo', slideDrink - 1);
            $(".new-drinkWrap").vegas('jump', slideDrink - 1);

            gsap.delayedCall(2, function() {
                clickLock = false;
            });
        });

        $('.drinkList li').hover(function() {
            var drink = $(this).data('drink');
            $(`.drinkList-pic ul.is-show li:nth-child(${drink})`).addClass('is-show').siblings().removeClass('is-show')
        });

        $(".menu-drinkList li").on("click", function() {
            gsap.to(window, {
                duration: 1.2,
                scrollTo: {
                    y: $("[data-where=" + $(this).index() + "]"),
                    offsetY: 10,
                },
                ease: Power2.easeInOut
            });
        });


        $('.drinkWrapList>li').each(function(i, el) {
            ScrollTrigger.create({
                toggleActions: "play pause resume reverse", //重覆觸發
                trigger: el,
                start: "top 70%",
                end: "bottom 70%",
                scrub: 1,
                // markers: true,
                onEnter() {
                    $(`.drinkList-pic .area-${i+1}`).addClass('is-show').siblings().removeClass('is-show')
                    $(`.menu-drinkList li:nth-child(${i+1})`).addClass('current').siblings().removeClass('current')
                    $('.drink-fixedList li.current').next().css('opacity', '0.4').next().css('opacity', '0.2').next().css('opacity', '0.1');
                    $('.drink-fixedList li.current').prev().css('opacity', '0.4').prev().css('opacity', '0.2').prev().css('opacity', '0.1');

                },
                // onLeave() {
                //     $('.about-info-preview').removeClass('is-not-show');
                // },
                onEnterBack() {
                    $(`.drinkList-pic .area-${i+1}`).addClass('is-show').siblings().removeClass('is-show')
                    $(`.menu-drinkList li:nth-child(${i+1})`).addClass('current').siblings().removeClass('current')
                    $('.drink-fixedList li.current').next().css('opacity', '0.4').next().css('opacity', '0.2').next().css('opacity', '0.1');
                    $('.drink-fixedList li.current').prev().css('opacity', '0.4').prev().css('opacity', '0.2').prev().css('opacity', '0.1');
                },
                onLeaveBack() {
                    $(`.drinkList-pic .area-${i+1}`).addClass('is-show').siblings().removeClass('is-show')
                    $(`.menu-drinkList li:nth-child(${i+1})`).addClass('current').siblings().removeClass('current')
                    $('.drink-fixedList li.current').next().css('opacity', '0.4').next().css('opacity', '0.2').next().css('opacity', '0.1');
                    $('.drink-fixedList li.current').prev().css('opacity', '0.4').prev().css('opacity', '0.2').prev().css('opacity', '0.1');
                },
            });
        })

        $('.drinkWrapList>li>.title').hover(function() {
            $('.drinkList-pic ul.is-show li:nth-child(1)').addClass('is-show').siblings().removeClass('is-show')
        });
        ScrollTrigger.create({
            toggleActions: "play pause resume reverse", //重覆觸發
            trigger: ".drinkList-pic",
            endTrigger: ".drinkWrap",
            start: "top 39%",
            end: "bottom 100%",
            scrub: 1,
            pin: true,
        });

    } else {
        $('html').css('overflow-x', 'initial');

        $('.new-drink').slick({
            dots: true,
            speed: 1500,
            slidesToShow: 1,
            slidesToScroll: 1,
            fade: true,
            autoplay: true,
            prevArrow: false,
            nextArrow: false,
            draggable: true,
            asNavFor: '.new-drinkWrap .pic'
        });
        $('.new-drinkWrap .new-drink').on('beforeChange', function(event, slick, currentSlide, nextSlide) {
            // console.log(nextSlide);
            $(".new-drinkWrap").vegas('jump', nextSlide);
        });

        $('.menu-select').on("click", function() {
            $('.menu-select').toggleClass('open');
        });
        $('.menu-select .list li').each(function(i, el) {
            $(el).on("click", function() {
                $('.menu-select span').text($(el).text());
                _m = $(el).data('menu');
                gsap.to(window, {
                    duration: 1.2,
                    scrollTo: {
                        y: $("[data-where=" + _m + "]"),
                        offsetY: 100,
                    },
                    ease: Power2.easeInOut
                });
            });
        })

        const swiper = new Swiper(".drink-mobile", {
            slidesPerView: "auto", //一個view的投影片數量，預設為1。如果沒寫這個，若投影片文字過長就會換行
            allowTouchMove: false, //不讓使用者觸碰移動slide

            autoplay: {
                delay: 0, //自動播放不延遲
                disableOnInteraction: false //不因使用者觸碰而停止自動播放
            },
            loop: true, //反覆循環
            speed: 5000 //投影片之間的過渡持續時間（以毫秒為單位），數字愈大跑愈慢
        });

        function drinkMobileChange(i, s) {
            gsap.delayedCall(s, function() {
                $('.drinkWrapList .slick-current.drinkList>li').each(function(j, del) {
                    ScrollTrigger.create({
                        toggleActions: "play pause resume reverse", //重覆觸發
                        trigger: del,
                        start: "top 70%",
                        end: "bottom 70%",
                        scrub: 1,
                        // markers: true,
                        onEnter() {
                            var _d = $(del).data('drink');
                            $(`.drinkList-pic .area-${i+1}>li:nth-child(${_d+1})`).addClass('is-show').siblings().removeClass('is-show')
                        },
                        onLeave() {},
                        onEnterBack() {
                            var _d = $(del).data('drink');
                            $(`.drinkList-pic .area-${i+1}>li:nth-child(${_d+1})`).addClass('is-show').siblings().removeClass('is-show')
                        },
                        onLeaveBack() {},
                    });
                })
            });
        }
        // $('.drinkWrapList .slick-current.drinkList>li').each(function(i, el) {
        //     $(el).click(function() {
        //         var _d = $(this).data('drink');
        //         $(`.drinkList-pic .area-${i+1}>li:nth-child(${_d+1})`).addClass('is-show').siblings().removeClass('is-show')
        //     })
        // })

        $('.drinkWrapList>li').each(function(i, el) {
            ScrollTrigger.create({
                toggleActions: "play pause resume reverse", //重覆觸發
                trigger: el,
                start: "20% 80%",
                end: "bottom 80%",
                scrub: 1,
                // markers: true,
                onEnter() {
                    $(`.drinkList-pic .area-${i+1} `).addClass('is-show').siblings().removeClass('is-show')
                    drinkMobileChange(i, 0.1);
                },
                onLeave() {
                    $(`.drinkList-pic .area-${i+1}`).removeClass('is-show')
                    drinkMobileChange(i, 0.1);
                },
                onEnterBack() {
                    $(`.drinkList-pic .area-${i+1}`).addClass('is-show').siblings().removeClass('is-show')
                    drinkMobileChange(i, 0.1);
                },
                onLeaveBack() {
                    $(`.drinkList-pic .area-${i+1}`).removeClass('is-show')
                    drinkMobileChange(i, 0.1);
                },
            });
            $('.drinkWrapList .drink-changeList .slick-dots>li').click(function() {
                drinkMobileChange(i, 1);
            })
            $('.drinkWrapList .drinkList>li').click(function() {
                $(this).addClass('current').siblings().removeClass('current')
                var _d = $(this).data('drink');
                $(`.drinkList-pic .area-${i+1}>li:nth-child(${_d+1})`).addClass('is-show').siblings().removeClass('is-show')
            })
        })

        $('.drinkWrapList>li>.title').each(function(t, tel) {
            ScrollTrigger.create({
                toggleActions: "play pause resume reverse", //重覆觸發
                trigger: tel,
                start: "top 70%",
                end: "bottom 70%",
                scrub: 1,
                // markers: true,
                onEnter() {
                    $('.drinkList-pic ul.is-show li:nth-child(1)').addClass('is-show').siblings().removeClass('is-show')
                },
                onLeave() {},
                onEnterBack() {
                    $('.drinkList-pic ul.is-show li:nth-child(1)').addClass('is-show').siblings().removeClass('is-show')
                },
                onLeaveBack() {},
            });
        })
        $('.drinkList>li').each(function(i, el) {
            ScrollTrigger.create({
                toggleActions: "play pause resume reverse", //重覆觸發
                trigger: el,
                start: "20% 70%",
                end: "bottom 70%",
                scrub: 1,
                // markers: true,
                onEnter() {
                    $(el).addClass('current').siblings().removeClass('current')
                },
                onLeave() {
                    $(el).addClass('current').siblings().removeClass('current')
                },
                onEnterBack() {
                    $(el).addClass('current').siblings().removeClass('current')
                },
                onLeaveBack() {
                    $(el).addClass('current').siblings().removeClass('current')
                },
            });
        })

    }

    $('.drink-changeList').each(function(i, el) {
        $(el).slick({
            dots: true,
            speed: 1000,
            slidesToShow: 1,
            slidesToScroll: 1,
            fade: true,
            // autoplay: true,
            prevArrow: false,
            nextArrow: false,
        });
        // $(el).on('afterChange', function(event, slick, currentSlide, nextSlide) {
        //     drinkMobileChange();
        // });
    })
    var dotNums = document.querySelectorAll(".slick-dots button");

    function removeText(item) {
        item.innerHTML = ""; // or put the text you need inside quotes
    }
    dotNums.forEach(removeText);


    ScrollTrigger.create({
        toggleActions: "play pause resume reverse", //重覆觸發
        trigger: ".menu-drinkList",
        endTrigger: ".drinkWrap",
        start: "top 9%",
        end: "bottom 90%",
        scrub: 1,
        pin: true,
        // markers: true,
    });


    // drinkMobileChange();

    // $('.drinkWrapList.hide-for-large .drink-changeList .slick-dots>li').click(function() {
    //     gsap.delayedCall(1, function() {
    //         drinkMobileChange();
    //     });

    // })

    $('.drink-fixedList li.current').next().css('opacity', '0.4').next().css('opacity', '0.2').next().css('opacity', '0.1');
    $('.drink-fixedList li.current').prev().css('opacity', '0.4').prev().css('opacity', '0.2').prev().css('opacity', '0.1');

    $('.drink-fixedList li').click(function() {
        $(this).addClass('current').siblings().removeClass('current');
        $('.drink-fixedList li.current').next().css('opacity', '0.4').next().css('opacity', '0.2').next().css('opacity', '0.1');
        $('.drink-fixedList li.current').prev().css('opacity', '0.4').prev().css('opacity', '0.2').prev().css('opacity', '0.1');

    })
</script>